namespace Coldairarrow.Util
{
    /// <summary>
    /// 系统日志类型
    /// </summary>
    public enum UserLogType
    {
        系统异常,
        系统用户管理,
        系统角色管理,
        接口密钥管理,
        部门管理,
        数据字典,
        仓库管理,
        系统参数,
        巷道管理,
        计量单位,
        仓库权限,
        客户管理,
        托盘类型,
        托盘管理,
        供应商管理,
        物料类型,
        物料管理,
        条码类型,
        货区管理,
        货位管理,
        移库管理,
        入库管理,
        盘点管理,
        出库管理,
        报损管理,
        调拨管理,
        收货管理,
        发货管理,
        计划表
    }
}
